In [7]:
import pandas as pd
df1 = pd.DataFrame({
    "city":["New York","Chicago","New Orleans","Baltimore"],
    "temperature":[25,16,32,23]
})
df1

          city  temperature
0     New York           25
1      Chicago           16
2  New Orleans           32
3    Baltimore           23

In [8]:
df2 = pd.DataFrame({
    "city":["Chicago","Orlando","San Francisco"],
    "humidity":[65,78,85]
})
df2

            city  humidity
0        Chicago        65
1        Orlando        78
2  San Francisco        85

In [27]:
df3 = pd.merge(df1,df2,how="outer",indicator=True)
df3

            city  temperature  humidity      _merge
0       New York         25.0       NaN   left_only
1        Chicago         16.0      65.0        both
2    New Orleans         32.0       NaN   left_only
3      Baltimore         23.0       NaN   left_only
4        Orlando          NaN      78.0  right_only
5  San Francisco          NaN      85.0  right_only